Synwit-Co-Ltd/SWM160/SWM160_Lib/SWM160_StdPeriph_Driver/CSL/SWM160_StdPeriph_Driver/SWM160_can.c
/****************************************************************************************************************************************** 
* 文件名称: SWM160_can.c
* 功能说明:	SWM160单片机的WDT看门狗功能驱动库
* 技术支持:	http://www.synwit.com.cn/e/tool/gbook/?bid=1
* 注意事项:
* 版本日期:	V1.0.0		2016年1月30日
* 升级记录: 
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology
*******************************************************************************************************************************************/
#include "SWM160.h"
#include "SWM160_can.h"

/****************************************************************************************************************************************** 
* 函数名称:	CAN_Init()
* 功能说明:	CAN接口初始化
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
*			CAN_InitStructure * initStruct    包含CAN接口相关设定值的结构体
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_Init(CAN_TypeDef * CANx, CAN_InitStructure * initStruct)
{	
	switch((uint32_t)CANx)
	{
	case ((uint32_t)CAN):
		SYS->CLKEN |= (0x01 << SYS_CLKEN_CAN_Pos);
		break;
	}
	
	CAN_Close(CANx);	//一些关键寄存器只能在CAN关闭时设置
	
	CANx->CR &= ~(CAN_CR_LOM_Msk | CAN_CR_STM_Msk | CAN_CR_AFM_Msk);
	CANx->CR |= (initStruct->Mode << CAN_CR_LOM_Pos) |
				(initStruct->FilterMode << CAN_CR_AFM_Pos);
	
	CANx->FILTER.AMR[3] = initStruct->FilterMask32b & 0xFF;
	CANx->FILTER.AMR[2] = (initStruct->FilterMask32b >>  8) & 0xFF;
	CANx->FILTER.AMR[1] = (initStruct->FilterMask32b >> 16) & 0xFF;
	CANx->FILTER.AMR[0] = (initStruct->FilterMask32b >> 24) & 0xFF;
	
	CANx->FILTER.ACR[3] = initStruct->FilterCheck32b & 0xFF;
	CANx->FILTER.ACR[2] = (initStruct->FilterCheck32b >>  8) & 0xFF;
	CANx->FILTER.ACR[1] = (initStruct->FilterCheck32b >> 16) & 0xFF;
	CANx->FILTER.ACR[0] = (initStruct->FilterCheck32b >> 24) & 0xFF;
	
	CANx->BT1 = (0 << CAN_BT1_SAM_Pos) |
				(initStruct->CAN_BS1 << CAN_BT1_TSEG1_Pos) |
				(initStruct->CAN_BS2 << CAN_BT1_TSEG2_Pos);
	
	CANx->BT0 = (initStruct->CAN_SJW << CAN_BT0_SJW_Pos) |
				((SystemCoreClock/2/initStruct->Baudrate/(1 + (initStruct->CAN_BS1 + 1) + (initStruct->CAN_BS2 + 1)) - 1) << CAN_BT0_BRP_Pos);
	
	CANx->RXERR = 0;	//只能在复位模式下清除
	CANx->TXERR = 0;
	
	CANx->IE = (initStruct->RXNotEmptyIEn << CAN_IE_RXDA_Pos)    |
			   (initStruct->RXOverflowIEn << CAN_IE_RXOV_Pos)    |
			   (initStruct->ArbitrLostIEn << CAN_IE_ARBLOST_Pos) |
			   (initStruct->ErrPassiveIEn << CAN_IE_ERRPASS_Pos);
	
	switch((uint32_t)CANx)
	{
	case ((uint32_t)CAN):
		if(initStruct->RXNotEmptyIEn | initStruct->RXOverflowIEn | initStruct->ArbitrLostIEn | initStruct->ErrPassiveIEn)
		{
			NVIC_EnableIRQ(CAN_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(CAN_IRQn);
		}
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_Open()
* 功能说明:	CAN接口打开
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_Open(CAN_TypeDef * CANx)
{
	CANx->CR &= ~(0x01 << CAN_CR_RST_Pos);	//退出复位模式，进入工作模式
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_Close()
* 功能说明:	CAN接口关闭
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_Close(CAN_TypeDef * CANx)
{
	CANx->CR |= (0x01 << CAN_CR_RST_Pos);	//进入复位模式，不能发送和接收数据
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_Transmit()
* 功能说明:	CAN发送数据
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
*			uint32_t format		CAN_FRAME_STD 标准帧    CAN_FRAME_EXT 扩展帧
*			uint32_t id			消息ID
*			uint8_t data[]		要发送的数据
*			uint32_t size		要发送的数据的个数
*			uint32_t once		只发送一次，即使发送失败（仲裁丢失、发送出错、NAK）也不尝试重发
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_Transmit(CAN_TypeDef * CANx, uint32_t format, uint32_t id, uint8_t data[], uint32_t size, uint32_t once)
{
	uint32_t i;
	
	if(format == CAN_FRAME_STD)
	{
		CANx->TXFRAME.INFO = (0 << CAN_INFO_FF_Pos)  |
							 (0 << CAN_INFO_RTR_Pos) |
							 (size << CAN_INFO_DLC_Pos);
		
		CANx->TXFRAME.DATA[0] = id >> 3;
		CANx->TXFRAME.DATA[1] = id << 5;
		
		for(i = 0; i < size; i++)
		{
			CANx->TXFRAME.DATA[i+2] = data[i];
		}
	}
	else //if(format == CAN_FRAME_EXT)
	{
		CANx->TXFRAME.INFO = (1 << CAN_INFO_FF_Pos)  |
							 (0 << CAN_INFO_RTR_Pos) |
							 (size << CAN_INFO_DLC_Pos);
		
		CANx->TXFRAME.DATA[0] = id >> 21;
		CANx->TXFRAME.DATA[1] = id >> 13;
		CANx->TXFRAME.DATA[2] = id >>  5;
		CANx->TXFRAME.DATA[3] = id <<  3;
		
		for(i = 0; i < size; i++)
		{
			CANx->TXFRAME.DATA[i+4] = data[i];
		}
	}
	
	if(CANx->CR & CAN_CR_STM_Msk)
	{
		CANx->CMD = (1 << CAN_CMD_SRR_Pos);
	}
	else
	{
		if(once == 0)
		{
			CANx->CMD = (1 << CAN_CMD_TXREQ_Pos);
		}
		else
		{
			CANx->CMD = (1 << CAN_CMD_TXREQ_Pos) | (1 << CAN_CMD_ABTTX_Pos);
		}
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_TransmitRequest()
* 功能说明:	CAN发送远程请求，请求远程节点发送数据
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
*			uint32_t format		CAN_FRAME_STD 标准帧    CAN_FRAME_EXT 扩展帧
*			uint32_t id			消息ID
*			uint32_t once		只发送一次，即使发送失败（仲裁丢失、发送出错、NAK）也不尝试重发
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_TransmitRequest(CAN_TypeDef * CANx, uint32_t format, uint32_t id, uint32_t once)
{
	if(format == CAN_FRAME_STD)
	{
		CANx->TXFRAME.INFO = (0 << CAN_INFO_FF_Pos)  |
							 (1 << CAN_INFO_RTR_Pos) |
							 (0 << CAN_INFO_DLC_Pos);
		
		CANx->TXFRAME.DATA[0] = id >> 3;
		CANx->TXFRAME.DATA[1] = id << 5;
	}
	else //if(format == CAN_FRAME_EXT)
	{
		CANx->TXFRAME.INFO = (1 << CAN_INFO_FF_Pos)  |
							 (1 << CAN_INFO_RTR_Pos) |
							 (0 << CAN_INFO_DLC_Pos);
		
		CANx->TXFRAME.DATA[0] = id >> 21;
		CANx->TXFRAME.DATA[1] = id >> 13;
		CANx->TXFRAME.DATA[2] = id >>  5;
		CANx->TXFRAME.DATA[3] = id <<  3;
	}
	
	if(once == 0)
	{
		CANx->CMD = (1 << CAN_CMD_TXREQ_Pos);
	}
	else
	{
		CANx->CMD = (1 << CAN_CMD_TXREQ_Pos) | (1 << CAN_CMD_ABTTX_Pos);
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_Receive()
* 功能说明:	CAN接收数据
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
*			CAN_RXMessage *msg	接收到的消息存储在此结构体变量中
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_Receive(CAN_TypeDef * CANx, CAN_RXMessage *msg)
{
	uint32_t i;
	msg->format = (CANx->RXFRAME.INFO & CAN_INFO_FF_Msk) >> CAN_INFO_FF_Pos;
	
	msg->remote = (CANx->RXFRAME.INFO & CAN_INFO_RTR_Msk) >> CAN_INFO_RTR_Pos;
	msg->size = (CANx->RXFRAME.INFO & CAN_INFO_DLC_Msk) >> CAN_INFO_DLC_Pos;
	
